hw4/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "movies" SET "title" = ?, "director" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "The Terminator 2"], ["director", "James Cameron"], ["release_date", "1989-10-26 00:00:00.000000"], ["updated_at", "2015-11-30 18:22:26.669821"], ["id", 2]]

  def similar
    @movie = Movie.find params[:id]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]